MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX110F016C.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="n-------------nnn-----------nnnn" edc:cname="TraceBPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="TraceBPC" edc:nmmrflags="0d" edc:nmmrid="732" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IBPOn" edc:desc="" edc:mask="0xf" edc:name="IBPOn" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="11"/>
            <edc:SFRFieldDef edc:cname="IE" edc:desc="" edc:mask="0x1" edc:name="IE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DBPOn" edc:desc="" edc:mask="0x3" edc:name="DBPOn" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="13"/>
            <edc:SFRFieldDef edc:cname="DE" edc:desc="" edc:mask="0x1" edc:name="DE" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="Debug2" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="Debug2" edc:nmmrflags="0e" edc:nmmrid="860" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="debug2" edc:desc="" edc:mask="0xffffffff" edc:name="debug2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DEPC" edc:nmmrflags="0t" edc:nmmrid="224" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DEPC" edc:desc="" edc:mask="0xffffffff" edc:name="DEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ErrorEPC" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ErrorEPC" edc:nmmrflags="0t" edc:nmmrid="248" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ErrorEPC" edc:desc="" edc:mask="0xffffffff" edc:name="ErrorEPC" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DESAVE" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DESAVE" edc:nmmrflags="0t" edc:nmmrid="252" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DESAVE" edc:desc="" edc:mask="0xffffffff" edc:name="DESAVE" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="lo" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="lo" edc:nmmrflags="St" edc:nmmrid="1152" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUlow" edc:desc="" edc:mask="0xffffffff" edc:name="MDUlow" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR-NoSRS.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="hi" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="hi" edc:nmmrflags="St" edc:nmmrid="1156" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MDUhigh" edc:desc="" edc:mask="0xffffffff" edc:name="MDUhigh" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:NMMRPlace>
    <edc:EmulatorSector edc:beginaddr="0xff300000" edc:endaddr="0xff400000" edc:regionid="emulation"/>
    <edc:DeviceIDSector edc:_mask="0x0fffffff" edc:beginaddr="0xffffffff" edc:endaddr="0xffffffff" edc:mask="0x0fffffff" edc:regionid="devid" edc:useinchecksum="0x0fffffff" edc:value="0x04A09053">
      <edc:DEVIDToRev edc:revlist="A0" edc:value="0x00000000"/>
      <edc:DEVIDToRev edc:revlist="A1" edc:value="0x10000000"/>
    </edc:DeviceIDSector>
    <edc:CodeSector edc:beginaddr="0x1d000000" edc:endaddr="0x1d004000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:kuseg="0x60000000" edc:regionid="code"/>
    <edc:BootConfigSector edc:beginaddr="0x1fc00000" edc:endaddr="0x1fc00bf0" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="bootconfig"/>
    <edc:ConfigFuseSector edc:beginaddr="0x1fc00bf0" edc:endaddr="0x1fc00c00" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:regionid="config">
      <edc:DCRDef edc:_addr="0x1FC00BF0" edc:access="--nn------------nnnnnnnnnnnnnnnn" edc:cname="DEVCFG3" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0xf000ffff" edc:name="DEVCFG3" edc:nzwidth="32" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0xf0000000">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="USERID" edc:desc="" edc:mask="0xffff" edc:name="USERID" edc:nzwidth="16"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="PMDL1WAY" edc:desc="Peripheral Module Disable Configuration" edc:mask="0x1" edc:name="PMDL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="Peripheral Pin Select Configuration" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Allow only one reconfiguration" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Allow multiple reconfigurations" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC00BF4" edc:access="-------------nnn---------nnn-nnn" edc:cname="DEVCFG2" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x70077" edc:name="DEVCFG2" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x00070077">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FPLLIDIV" edc:desc="PLL Input Divider" edc:mask="0x7" edc:name="FPLLIDIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="1x Divider" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="2x Divider" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_3" edc:desc="3x Divider" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="4x Divider" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_5" edc:desc="5x Divider" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_6" edc:desc="6x Divider" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_10" edc:desc="10x Divider" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_12" edc:desc="12x Divider" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLMUL" edc:desc="PLL Multiplier" edc:mask="0x7" edc:name="FPLLMUL" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="MUL_15" edc:desc="15x Multiplier" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="MUL_16" edc:desc="16x Multiplier" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MUL_17" edc:desc="17x Multiplier" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MUL_18" edc:desc="18x Multiplier" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="MUL_19" edc:desc="19x Multiplier" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="MUL_20" edc:desc="20x Multiplier" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="MUL_21" edc:desc="21x Multiplier" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MUL_24" edc:desc="24x Multiplier" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPLLODIV" edc:desc="System PLL Output Clock Divider" edc:mask="0x7" edc:name="FPLLODIV" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="PLL Divide by 1" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="PLL Divide by 2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="PLL Divide by 4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="PLL Divide by 8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV_16" edc:desc="PLL Divide by 16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV_32" edc:desc="PLL Divide by 32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV_64" edc:desc="PLL Divide by 64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV_256" edc:desc="PLL Divide by 256" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:_addr="0x1FC00BF8" edc:access="------nnnn-nnnnnnnnn-nnnn-n--nnn" edc:cname="DEVCFG1" edc:default="0xffffffff" edc:desc="" edc:factorydefault="0xffffffff" edc:impl="0x3dff7a7" edc:name="DEVCFG1" edc:nzwidth="0x20" edc:unimplval="1" edc:unused="0x0" edc:useinchecksum="0x03DFF7A7">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Selection Bits" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Osc (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC Osc with PLL" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Osc (XT,HS,EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Osc w/PLL (XT+,HS+,EC+PLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Low Power Secondary Osc (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low Power RC Osc (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="FRCDIV16" edc:desc="Fast RC Osc w/Div-by-16 (FRC/16)" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Osc w/Div-by-N (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="FSOSCEN" edc:desc="Secondary Oscillator Enable" edc:mask="0x1" edc:name="FSOSCEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal/External Switch Over" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Configuration" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External clock mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT osc mode" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS osc mode" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Primary osc disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="CLKO Output Signal Active on the OSCO Pin" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="FPBDIV" edc:desc="Peripheral Clock Divisor" edc:mask="0x3" edc:name="FPBDIV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="DIV_1" edc:desc="Pb_Clk is Sys_Clk/1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="DIV_2" edc:desc="Pb_Clk is Sys_Clk/2" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DIV_4" edc:desc="Pb_Clk is Sys_Clk/4" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV_8" edc:desc="Pb_Clk is Sys_Clk/8" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor Selection" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock Switch Enable, FSCM Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock Switch Enable, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock Switch Disable, FSCM Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscaler" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="0x5">
              <edc:DCRFieldSemantic edc:cname="PS1" edc:desc="1:1" edc:when="(field &amp; 0x1f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="PS2" edc:desc="1:2" edc:when="(field &amp; 0x1f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS4" edc:desc="1:4" edc:when="(field &amp; 0x1f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS8" edc:desc="1:8" edc:when="(field &amp; 0x1f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS16" edc:desc="1:16" edc:when="(field &amp; 0x1f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PS32" edc:desc="1:32" edc:when="(field &amp; 0x1f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="PS64" edc:desc="1:64" edc:when="(field &amp; 0x1f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="PS128" edc:desc="1:128" edc:when="(field &amp; 0x1f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="PS256" edc:desc="1:256" edc:when="(field &amp; 0x1f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="PS512" edc:desc="1:512" edc:when="(field &amp; 0x1f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="PS1024" edc:desc="1:1024" edc:when="(field &amp; 0x1f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="PS2048" edc:desc="1:2048" edc:when="(field &amp; 0x1f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="PS4096" edc:desc="1:4096" edc:when="(field &amp; 0x1f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="PS8192" edc:desc="1:8192" edc:when="(field &amp; 0x1f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="PS16384" edc:desc="1:16384" edc:when="(field &amp; 0x1f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="PS32768" edc:desc="1:32768" edc:when="(field &amp; 0x1f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="PS65536" edc:desc="1:65536" edc:when="(field &amp; 0x17) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="PS131072" edc:desc="1:131072" edc:when="(field &amp; 0x17) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="PS262144" edc:desc="1:262144" edc:when="(field &amp; 0x17) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="PS524288" edc:desc="1:524288" edc:when="(field &amp; 0x17) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="PS1048576" edc:desc="1:1048576" edc:when="(field &amp; 0x14) == 0x14"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="WINDIS" edc:desc="Watchdog Timer Window Enable" edc:mask="0x1" edc:name="WINDIS" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Watchdog Timer is in Window Mode" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Watchdog Timer is in Non-Window Mode" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTEN" edc:desc="Watchdog Timer Enable" edc:mask="0x1" edc:name="FWDTEN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT Disabled (SWDTEN Bit Controls)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FWDTWINSZ" edc:desc="Watchdog Timer Window Size" edc:mask="0x3" edc:name="FWDTWINSZ" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="WINSZ_75" edc:desc="Window Size is 75%" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_50" edc:desc="Window Size is 50%" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_37" edc:desc="Window Size is 37.5%" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WINSZ_25" edc:desc="Window Size is 25%" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
